# =============================ALGO A1 LOOKUP=============================
a1_lookup <- list(
  # 原本有無設置人行空間
  sidewalk = list(
    "有設置人行道或騎樓" = 1,
    "沒有設置人行道或騎樓" = 0,
    "有人行道或騎樓" = 1,
    "沒有人行道或騎樓" = 0
  ),
  # 保護性
  protective = list(
    "實體人行道(有實體分隔)" =  1,
    "騎樓" = 1,
    "實體人行道(無實體分隔)" =  0.5,
    "標線人行道(無實體分隔)" =  0.4,
    "標線人行道(有實體分隔)" =  1,
    "實體人行道(有實體分隔)" =  1,
    "沒有人行道或騎樓" = 0
    # "" =  0
  ),
  # 原始寬度
  wheelchair = list(
    "輪椅可以通行（寬於100公分）" =  1,
    "輪椅無法通行（窄於100公分）" =  0.5,
    "沒有人行道或騎樓" = 0
  ),
  # 行人被迫碰到的最大動態風險
  walkRisk = list(
    '無車輛行駛' = 1,
    '有自行車行駛' = 0.8,
    '有機車行駛' = 0.4,
    '有汽車行駛' = 0,
    '無人行道或騎樓' = 0
  )
  # riskRate
)

# when one point has multiple values (list)
a1_lookup_multi <- list(
  occupation = list(
    "無佔用或阻礙" = 1,
    "私人佔用（商家、住家）" =  0.3,
    "公共設施阻礙（機電設備）" =  0.3,
    "公共設施阻礙（樹穴）" =  0.3,
    "公共設施阻礙（有停車格）" =  0.3,
    "公共設施阻礙（公車亭）" = 0.3, # 原始演算法無此項
    "私人佔用（臨時停車）" =  0.4,
    "沒有人行道或騎樓" = 0,
    "empty" = 1
  )
)

# =============================ALGO B1 LOOKUP=============================
b1_lookup <- list(
  # 原本有無設置人行空間
  # same as a1
  sidewalk = list(
    "有設置人行道或騎樓" = 1,
    "沒有設置人行道或騎樓" = 0,
    "有人行道或騎樓" = 1,
    "沒有人行道或騎樓" = 0
  ),
  # 保護性
  protective = list(
    "實體人行道(有實體分隔)" =  1,
    "騎樓" = 1,
    "實體人行道(無實體分隔)" =  0.3,
    "標線人行道(無實體分隔)" =  0.2,
    "標線人行道(有實體分隔)" =  1,
    "實體人行道(有實體分隔)" =  1,
    "沒有人行道或騎樓" = 0
    # "" =  0
  ),
  # 原始寬度
  # same as a1
  wheelchair = list(
    "輪椅可以通行（寬於100公分）" =  1,
    "輪椅無法通行（窄於100公分）" =  0.5,
    "沒有人行道或騎樓" = 0
  ),
  # 行人被迫碰到的最大動態風險
  walkRisk = list(
    '無車輛行駛' = 0,
    '有自行車行駛' = 0.2,
    '有機車行駛' = 0.6,
    '有汽車行駛' = 1,
    '無人行道或騎樓' = 0
  )
  # riskRate
)

b1_lookup_multi <- list(
  occupation = list(
    "無佔用或阻礙" = 0,
    "私人佔用（商家、住家）" =  0.7,
    "公共設施阻礙（機電設備）" =  0.7,
    "公共設施阻礙（樹穴）" =  0.7,
    "公共設施阻礙（有停車格）" =  0.7,
    "公共設施阻礙（公車亭）" = 0.7, # 原始演算法無此項
    "私人佔用（臨時停車）" =  0.6,
    "沒有人行道或騎樓" = 1,
    "empty" = 0
  )
)

# =============================ALGO C1 LOOKUP=============================
c1_lookup <- list(
  # 原本有無設置人行空間
  # same as a1
  sidewalk = list(
    "有設置人行道或騎樓" = 1,
    "沒有設置人行道或騎樓" = 0,
    "有人行道或騎樓" = 1,
    "沒有人行道或騎樓" = 0
  ),
  # 保護性
  protective = list(
    "實體人行道(有實體分隔)" =  1,
    "騎樓" = 1,
    "實體人行道(無實體分隔)" =  0.5,
    "標線人行道(無實體分隔)" =  0.2,
    "標線人行道(有實體分隔)" =  1,
    "實體人行道(有實體分隔)" =  1,
    "沒有人行道或騎樓" = 0
    # "" =  0
  ),
  # 原始寬度
  # same as a1
  wheelchair = list(
    "輪椅可以通行（寬於100公分）" =  1,
    "輪椅無法通行（窄於100公分）" =  0.5,
    "沒有人行道或騎樓" = 0
  ),
  # 行人被迫碰到的最大動態風險
  # same as a1
  walkRisk = list(
    '無車輛行駛' = 1,
    '有自行車行駛' = 0.8,
    '有機車行駛' = 0.4,
    '有汽車行駛' = 0,
    '無人行道或騎樓' = 0
  )
  # riskRate
)

c1_lookup_multi <- list(
  occupation = list(
    "無佔用或阻礙" = 1,
    "私人佔用（商家、住家）" =  0.5,
    "公共設施阻礙（機電設備）" =  0.5,
    "公共設施阻礙（樹穴）" =  0.5,
    "公共設施阻礙（有停車格）" =  0.5,
    "公共設施阻礙（公車亭）" = 0.5, # 原始演算法無此項
    "私人佔用（臨時停車）" =  0.4,
    "沒有人行道或騎樓" = 0,
    "empty" = 1
  )
)
